aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/ble/iot_ble_hal_gap.c
/** @brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void prvOnConnParamsEvt( ble_conn_params_evt_t * pxEvt );

/** @brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void prvConnParamsErrorHandler( uint32_t ulError );

/** @brief BLE advertising event handler type. */
static void prvOnAdvEvt( ble_adv_evt_t const adv_evt );

/** @brief BLE advertising error handler type. */
static void prvOnAdvErr( uint32_t nrf_error );

/** @brief Initialization of the Peer Manager module. */
static ret_code_t prvPeerManagerInit( void );

/** @brief Initialization of the advertisement parameters. */
static void prvAdvertisementDataInit( void );


/** @breef Frees all memory occupied with ble_advdata_t structure */
static void prvBTFreeAdvData( ble_advdata_t * xAdvData );

/** @breef Save parameters of the latest connection */
static void prvSetLatestConnParams( const BTBdaddr_t * pxBdAddr,
                                    uint32_t ulMinInterval,
                                    uint32_t ulMaxInterval,
                                    uint32_t ulLatency,
                                    uint32_t ulTimeout );

BTBleAdapter_t xBTLeAdapter =
{
    .pxBleAdapterInit                  = prvBTBleAdapterInit,
    .pxRegisterBleApp                  = prvBTRegisterBleApp,
    .pxUnregisterBleApp                = prvBTUnregisterBleApp,
    .pxGetBleAdapterProperty           = prvBTGetBleAdapterProperty,
    .pxSetBleAdapterProperty           = prvBTSetBleAdapterProperty,
    .pxGetallBleRemoteDeviceProperties = prvBTGetallBleRemoteDeviceProperties,
    .pxGetBleRemoteDeviceProperty      = prvBTGetBleRemoteDeviceProperty,
    .pxSetBleRemoteDeviceProperty      = prvBTSetBleRemoteDeviceProperty,
    .pxScan                            = prvBTScan,
    .pxConnect                         = prvBTConnect,
    .pxDisconnect                      = prvBTDisconnect,
    .pxStartAdv                        = prvBTStartAdv,
    .pxStopAdv                         = prvBTStopAdv,
    .pxReadRemoteRssi                  = prvBTReadRemoteRssi,
    .pxScanFilterParamSetup            = prvBTScanFilterParamSetup,
    .pxScanFilterAddRemove             = prvBTScanFilterAddRemove,
    .pxScanFilterEnable                = prvBTScanFilterEnable,
    .pxGetDeviceType                   = prvBTGetDeviceType,
    .pxSetAdvData                      = prvBTSetAdvData,
    .pxSetAdvRawData                   = prvBTSetAdvRawData,
    .pxConnParameterUpdateRequest      = prvBTConnParameterUpdateRequest,
    .pxSetScanParameters               = prvBTSetScanParameters,
    .pxMultiAdvEnable                  = prvBTMultiAdvEnable,
    .pxMultiAdvUpdate                  = prvBTMultiAdvUpdate,
    .pxMultiAdvSetInstData             = prvBTMultiAdvSetInstData,
    .pxMultiAdvDisable                 = prvBTMultiAdvDisable,
    .pxBatchscanCfgStorage             = prvBTBatchscanCfgStorage,
    .pxBatchscanEndBatchScan           = prvBTBatchscanEndBatchScan,
    .pxBatchscanDisBatchScan           = prvBTBatchscanDisBatchScan,
    .pxBatchscanReadReports            = prvBTBatchscanReadReports,
    .pxSetPreferredPhy                 = prvBTSetPreferredPhy,
    .pxReadPhy                         = prvBTReadPhy,
    .ppvGetGattClientInterface         = prvBTGetGattClientInterface,
    .ppvGetGattServerInterface         = prvBTGetGattServerInterface,
};

/*-----------------------------------------------------------*/


BTStatus_t prvBTBleAdapterInit( const BTBleAdapterCallbacks_t * pxCallbacks )
{
    ret_code_t xErrCode = NRF_SUCCESS;
    BTStatus_t xStatus = eBTStatusSuccess;
    const char * error;


    memset( &prvAdvData, 0, sizeof( prvAdvData ) );
    memset( &prvScanResponseData, 0, sizeof( prvScanResponseData ) );
    memset( &xConnectionRemoteAddress, 0, sizeof( xConnectionRemoteAddress ) );

    /* Configure the BLE stack using the default settings.*/
    /* Fetch the start address of the application RAM.*/
    xErrCode = nrf_sdh_ble_default_cfg_set( aws_ble_gap_configAPP_BLE_CONN_CFG_TAG, &prvRamStart );
    BT_NRF_PRINT_ERROR( nrf_sdh_ble_default_cfg_set, xErrCode );

    if( xErrCode == NRF_SUCCESS )
    {
        /* Enable BLE stack.*/
        xErrCode = nrf_sdh_ble_enable( &prvRamStart );
        printf( "The RAM must start at %x, it's size must be %x\n", prvRamStart, 0x20040000 - prvRamStart );
        BT_NRF_PRINT_ERROR( nrf_sdh_ble_enable, xErrCode );
    }

    if( xErrCode == NRF_SUCCESS )
    {
        xErrCode = prvConnectionParamsInit();
        BT_NRF_PRINT_ERROR( prvConnectionParamsInit, xErrCode );
    }

    if( xErrCode == NRF_SUCCESS )
    {
        prvPeerManagerInit();
        BT_NRF_PRINT_ERROR( prvConnectionParamsInit, xErrCode );
    }

    if( xErrCode == NRF_SUCCESS )
    {
        prvAdvertisementDataInit();
    }

    xStatus = BTNRFError( xErrCode );

    error = nrf_strerror_get( xErrCode );

    /* TODO: Add initial security */
    if( pxCallbacks != NULL )
    {
        xBTBleAdapterCallbacks = *pxCallbacks;
    }
    else
    {
        xStatus = eBTStatusFail;
    }

    return xStatus;
}

ret_code_t prvPeerManagerInit( void )
{
    ret_code_t xErrCode = NRF_SUCCESS;


    if( xErrCode == NRF_SUCCESS )
    {
        xErrCode = pm_init();
        BT_NRF_PRINT_ERROR( pm_init, xErrCode );
    }

    if( xErrCode == NRF_SUCCESS )
    {
        xErrCode = pm_sec_params_set( &xSecurityParameters );
        BT_NRF_PRINT_ERROR( pm_sec_params_set, xErrCode );
    }

