aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/ble/iot_ble_hal_gap.c
    #ifdef TEST1
        if( xErrCode == NRF_SUCCESS )
        {
            xErrCode = pm_peers_delete();
            BT_NRF_PRINT_ERROR( pm_sec_params_set, xErrCode );
        }
    #endif

    if( xErrCode == NRF_SUCCESS )
    {
        xErrCode = pm_register( prvPmEventHandler );
        BT_NRF_PRINT_ERROR( pm_register, xErrCode );
    }

    return xErrCode;
}

static void prvAdvertisementDataInit( void )
{
    /* Clear the advertisement handle with the stack. */
    memset( &xAdvertisingHandle, 0x00, sizeof( xAdvertisingHandle ) );

    /* Clear the global variables used by the porting layer. */
    prvAdvRestart = false;
    memset( &prvAdvData, 0x00, sizeof( ble_advdata_t ) );
    memset( &prvScanResponseData, 0x00, sizeof( ble_advdata_t ) );

    /* Clear the advertisment and scan response cache. Reset the index to 0. */
    memset( prvAdvBinData, 0x00, sizeof( prvAdvBinData ) );
    memset( prvSrBinData, 0x00, sizeof( prvSrBinData ) );
    prvCurrentAdvBuf = 0;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTRegisterBleApp( BTUuid_t * pxAppUuid )
{
    ret_code_t xErrCode = NRF_SUCCESS;

    if( ucBaseUUIDindex != 0 )
    {
        /* We allow only one app to be registered */
        xErrCode = NRF_ERROR_INVALID_PARAM;
    }

    if( xErrCode == NRF_SUCCESS )
    {
        /* TODO: Think, do we even need that? */
        xErrCode = sd_ble_uuid_vs_add( ( ble_uuid128_t * ) pxAppUuid->uu.uu128, &ucBaseUUIDindex );
    }

    BT_NRF_PRINT_ERROR( sd_ble_uuid_vs_add, xErrCode );

    if( xErrCode == NRF_SUCCESS )
    {
        xAppUuid.ucType = pxAppUuid->ucType;
        memcpy( &xAppUuid.uu.uu128, &( pxAppUuid->uu.uu128 ), bt128BIT_UUID_LEN );

        if( xBTBleAdapterCallbacks.pxRegisterBleAdapterCb )
        {
            xBTBleAdapterCallbacks.pxRegisterBleAdapterCb( eBTStatusSuccess, 0, pxAppUuid );
        }
    }

    return BTNRFError( xErrCode );
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTUnregisterBleApp( uint8_t ucAdapterIf )
{
    ret_code_t xErrCode = NRF_SUCCESS;

    if( ucBaseUUIDindex == 0 )
    {
        /* No app is registered */
        xErrCode == NRF_ERROR_INVALID_PARAM;
    }

    xErrCode = ble_conn_params_stop();
    prvBTFreeAdvData( &prvAdvData );
    prvBTFreeAdvData( &prvScanResponseData );

    /* We cannot remove the VS UUID because the SoftDevice can only remove the latest vendor-specific UUID */
    if( xErrCode == NRF_SUCCESS )
    {
        /* xErrCode = sd_ble_uuid_vs_remove( &ucBaseUUIDindex ); */
        ucBaseUUIDindex = 0;
    }

    BT_NRF_PRINT_ERROR( sd_ble_uuid_vs_remove, xErrCode );

    return BTNRFError( xErrCode );
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetBleAdapterProperty( BTBlePropertyType_t xType )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetBleAdapterProperty( const BTBleProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTGetallBleRemoteDeviceProperties( BTBdaddr_t * pxRremoteAddr )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTGetBleRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                            BTBleProperty_t xType )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTSetBleRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                            const BTBleProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScan( bool bStart )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTConnect( uint8_t ucAdapterIf,
                         const BTBdaddr_t * pxBdAddr,
                         bool bIsDirect,
                         BTTransport_t ulTransport )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/


BTStatus_t prvBTDisconnect( uint8_t ucAdapterIf,
                            const BTBdaddr_t * pxBdAddr,
                            uint16_t usConnId )
{
    ret_code_t xErrCode;

    xErrCode = sd_ble_gap_disconnect( usConnId, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION );
    BT_NRF_PRINT_ERROR( sd_ble_gap_disconnect, xErrCode );
    return BTNRFError( xErrCode );
}

/*-----------------------------------------------------------*/

ret_code_t prvStartAdv()
{
    ret_code_t xStatus;

    if( prvAdvRestart )
    {
        xStatus = prvResumeAdvertisement( BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED );
    }
    else
    {
        prvAdvRestart = true;
        xStatus = ble_advertising_start( &xAdvertisingHandle, BLE_ADV_MODE_FAST );
    }

    if( NRF_SUCCESS == xStatus )
    {
        bIsAdvertising = true;
    }

    return xStatus;
}

ret_code_t prvStopAdv()
{
    return sd_ble_gap_adv_stop( xAdvertisingHandle.adv_handle );
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTStartAdv( uint8_t ucAdapterIf )
{
    BTStatus_t xStatus;
    ret_code_t xErrCode = prvStartAdv();

    BT_NRF_PRINT_ERROR( ble_advertising_start, xErrCode );

    xStatus = BTNRFError( xErrCode );

    if( xBTBleAdapterCallbacks.pxAdvStatusCb )
    {
        xBTBleAdapterCallbacks.pxAdvStatusCb( xStatus, 0, true );
    }

    if( xStatus != eBTStatusSuccess )
    {
        IotLogError( "Failed to start advertisement." );
    }

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTStopAdv( uint8_t ucAdapterIf )
{
    BTStatus_t xStatus;
    ret_code_t xErrCode;

