aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/ble/iot_ble_hal_gap.c
    bIsAdvertising = false;
    xErrCode = prvStopAdv();

    /* User can inadvertentely try to stop advertising when it is already stopped,
     * for example when connection is established and SD stopped advertising itself.
     * In this case we are going to get NRF_ERROR_INVALID_STATE, but this is fine */
    if( xErrCode == NRF_ERROR_INVALID_STATE )
    {
        xErrCode = NRF_SUCCESS;
        NRF_LOG_WARNING( "Attempt to stop an already stopped advertising" );
    }

    BT_NRF_PRINT_ERROR( sd_ble_gap_adv_stop, xErrCode );
    xStatus = BTNRFError( xErrCode );

    if( xBTBleAdapterCallbacks.pxAdvStatusCb )
    {
        xBTBleAdapterCallbacks.pxAdvStatusCb( xStatus, 0, false );
    }

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTReadRemoteRssi( uint8_t ucAdapterIf,
                                const BTBdaddr_t * pxBdAddr )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScanFilterParamSetup( BTGattFiltParamSetup_t xFiltParam )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScanFilterAddRemove( uint8_t ucAdapterIf,
                                     uint32_t ulAction,
                                     uint32_t ulFiltType,
                                     uint32_t ulFiltIndex,
                                     uint32_t ulCompanyId,
                                     uint32_t ulCompanyIdMask,
                                     const BTUuid_t * pxUuid,
                                     const BTUuid_t * pxUuidMask,
                                     const BTBdaddr_t * pxBdAddr,
                                     char cAddrType,
                                     size_t xDataLen,
                                     char * pcData,
                                     size_t xMaskLen,
                                     char * pcMask )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTScanFilterEnable( uint8_t ucAdapterIf,
                                  bool bEnable )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTTransport_t prvBTGetDeviceType( const BTBdaddr_t * pxBdAddr )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

ret_code_t prvAFRUUIDtoNordic( BTUuid_t * pxAFRUuid,
                               ble_uuid_t * pxNordicUUID )
{
    ret_code_t xStatus = NRF_SUCCESS;
    ble_uuid128_t xNordicUUID128;

    switch( pxAFRUuid->ucType )
    {
        case eBTuuidType16:
            pxNordicUUID->type = BLE_UUID_TYPE_BLE;
            pxNordicUUID->uuid = pxAFRUuid->uu.uu16;
            break;

        case eBTuuidType128:

            for( int i = 0; i < 16; ++i )
            {
                xNordicUUID128.uuid128[ i ] = pxAFRUuid->uu.uu128[ i ];
            }

            xStatus = sd_ble_uuid_vs_add( &xNordicUUID128, &pxNordicUUID->type );
            pxNordicUUID->uuid = *( ( uint16_t * ) &( xNordicUUID128.uuid128[ 12 ] ) );
            break;

        default:
            xStatus = NRF_ERROR_NOT_SUPPORTED;
    }

    return xStatus;
}

void prvBTFreeAdvData( ble_advdata_t * xAdvData )
{
    IotBle_Free( xAdvData->p_tx_power_level );
    IotBle_Free( xAdvData->p_slave_conn_int );

    IotBle_Free( xAdvData->uuids_complete.p_uuids );
    IotBle_Free( xAdvData->uuids_more_available.p_uuids );
    IotBle_Free( xAdvData->uuids_solicited.p_uuids );

    if( xAdvData->p_manuf_specific_data )
    {
        IotBle_Free( xAdvData->p_manuf_specific_data->data.p_data );
    }

    IotBle_Free( xAdvData->p_manuf_specific_data );

    if( xAdvData->p_service_data_array )
    {
        IotBle_Free( xAdvData->p_service_data_array->data.p_data );
    }

    IotBle_Free( xAdvData->p_service_data_array );
    IotBle_Free( xAdvData->p_tk_value );
    IotBle_Free( xAdvData->p_sec_mgr_oob_flags );
    IotBle_Free( xAdvData->p_lesc_data );
    memset( xAdvData, 0, sizeof( ble_gap_adv_data_t ) );
}

ret_code_t prvBTAdvDataConvert( ble_advdata_t * xAdvData,
                                BTGattAdvertismentParams_t * pxParams,
                                uint16_t usManufacturerLen,
                                char * pcManufacturerData,
                                uint16_t usServiceDataLen,
                                char * pcServiceData,
                                BTUuid_t * pxServiceUuid,
                                size_t xNbServices )
{
    prvBTFreeAdvData( xAdvData );
    ret_code_t xErrCode = NRF_SUCCESS;

    uint16_t companyId = 0;

    ble_advdata_uuid_list_t xCompleteUUIDS;

    memset( &xCompleteUUIDS, 0, sizeof( xCompleteUUIDS ) );

    if( pxParams->ulAppearance )
    {
        xAdvData->include_appearance = pxParams->ulAppearance;
    }

    xAdvData->flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    if( ( pxParams->ucName.xType == BTGattAdvNameComplete ) || ( IOT_BLE_DEVICE_SHORT_LOCAL_NAME_SIZE >= sizeof( IOT_BLE_DEVICE_COMPLETE_LOCAL_NAME ) - 1 ) )
    {
        xAdvData->name_type = BLE_ADVDATA_FULL_NAME;
    }
    else if( pxParams->ucName.xType == BTGattAdvNameShort )
    {
        xAdvData->name_type = BLE_ADVDATA_SHORT_NAME;
        xAdvData->short_name_len = IOT_BLE_DEVICE_SHORT_LOCAL_NAME_SIZE;
    }
    else
    {
        xAdvData->name_type = BLE_ADVDATA_NO_NAME;
    }

    if( pxParams->bIncludeTxPower )
    {
        xAdvData->p_tx_power_level = IotBle_Malloc( sizeof( int8_t ) );

        if( xAdvData->p_tx_power_level == NULL )
        {
            xErrCode = NRF_ERROR_NO_MEM;
        }
        else
        {
            *xAdvData->p_tx_power_level = 0; /* TODO: Find out where to get real tx_power */
        }
    }
    else
    {
        xAdvData->p_tx_power_level = NULL;
    }

