aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/ble/iot_ble_hal_gap.c
    if( xErrCode == NRF_SUCCESS )
    {
        xAdvData->include_ble_device_addr = false; /* TODO: Find out where to get whether set address or not */

        /* TODO: Set address type */
        /* TODO: Find out what to do with the channel map */
        if( xNbServices != 0 )
        {
            xCompleteUUIDS.uuid_cnt = xNbServices;
            xCompleteUUIDS.p_uuids = IotBle_Malloc( sizeof( ble_uuid_t ) * xNbServices );

            if( xCompleteUUIDS.p_uuids == NULL )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }

            for( uint8_t ucCService = 0; ucCService < xNbServices; ucCService++ )
            {
                if( ( pxServiceUuid[ ucCService ].ucType == eBTuuidType16 ) ||
                    ( pxServiceUuid[ ucCService ].ucType == eBTuuidType128 ) )
                {
                    if( xErrCode != NRF_SUCCESS )
                    {
                        break;
                    }

                    /* We've already checeked the correctness of UUID type before, so we can ignore the returned value */
                    prvAFRUUIDtoNordic( &pxServiceUuid[ ucCService ], &xCompleteUUIDS.p_uuids[ ucCService ] );
                }
                else
                {
                    xErrCode = NRF_ERROR_NOT_SUPPORTED;
                }
            }
        }
    }

    if( xErrCode == NRF_SUCCESS )
    {
        /* The first two UUID go to the initial advertisement packet */
        xAdvData->uuids_complete = xCompleteUUIDS;

        if( ( pxParams->ulMaxInterval != 0 ) && ( pxParams->ulMinInterval != 0 ) )
        {
            xAdvData->p_slave_conn_int = IotBle_Malloc( sizeof( ble_advdata_conn_int_t ) );

            if( xAdvData->p_slave_conn_int != NULL )
            {
                xAdvData->p_slave_conn_int->max_conn_interval = pxParams->ulMaxInterval;
                xAdvData->p_slave_conn_int->min_conn_interval = pxParams->ulMinInterval;
            }
            else
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }
        }
        else if( ( pxParams->ulMinInterval != 0 ) || ( pxParams->ulMaxInterval != 0 ) )
        {
            IotLogError( "Invalid params in advertisement/scan response: either min connection interval or max connection interval is zero" );
            xErrCode = NRF_ERROR_INVALID_PARAM;
        }
        else
        {
            /* Do nothing. User have set min interval and max interval to 0 to not include this in advertisment. */
        }

        /* Set manufacturer specific data only when its length is atleast equal to iot_ble_hal_gapADVERTISING_COMPANY_ID_SIZE */
        if( ( pcManufacturerData != NULL ) && ( usManufacturerLen >= iot_ble_hal_gapADVERTISING_COMPANY_ID_SIZE ) )
        {
            xAdvData->p_manuf_specific_data = IotBle_Malloc( sizeof( ble_advdata_manuf_data_t ) );

            if( xAdvData->p_manuf_specific_data == NULL )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }
            else
            {
                /* extract company_identifier from input manufacturer data
                 * because nordic sdk has separate field for company_identifier.
                 * Company identifier is two bytes in size stored in little endian form.
                 * Extract the bytes and store it into a 16bit variable.
                 */
                for( uint8_t i = 0; i < iot_ble_hal_gapADVERTISING_COMPANY_ID_SIZE; i++ )
                {
                    companyId = companyId | ( ( uint16_t ) pcManufacturerData[ i ] << ( i * 8 ) );
                }

                xAdvData->p_manuf_specific_data->company_identifier = companyId;

                /* allocate memory for rest of the data in pcManufacturerData i.e. (usManufacturerLen - first 2 octets) */
                xAdvData->p_manuf_specific_data->data.p_data = IotBle_Malloc( usManufacturerLen - iot_ble_hal_gapADVERTISING_COMPANY_ID_SIZE );

                if( xAdvData->p_manuf_specific_data->data.p_data == NULL )
                {
                    xErrCode = NRF_ERROR_NO_MEM;
                }
                else
                {
                    /* copy data left after extracting company_identifier (first 2 octets) */
                    memcpy( xAdvData->p_manuf_specific_data->data.p_data, pcManufacturerData + iot_ble_hal_gapADVERTISING_COMPANY_ID_SIZE, usManufacturerLen );
                    xAdvData->p_manuf_specific_data->data.size = usManufacturerLen - iot_ble_hal_gapADVERTISING_COMPANY_ID_SIZE;
                }
            }
        }
    }

    if( xErrCode == NRF_SUCCESS )
    {
        if( ( pcServiceData != NULL ) && ( usServiceDataLen != 0 ) )
        {
            xAdvData->p_service_data_array = IotBle_Malloc( sizeof( ble_advdata_service_data_t ) );

            if( xAdvData->p_service_data_array == NULL )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }
            else
            {
                xAdvData->p_service_data_array->data.p_data = IotBle_Malloc( usServiceDataLen );

                if( xAdvData->p_service_data_array->data.p_data )
                {
                    xErrCode = NRF_ERROR_NO_MEM;
                }
                else
                {
                    memcpy( xAdvData->p_service_data_array->data.p_data, pcServiceData, usServiceDataLen );
                    xAdvData->p_service_data_array->data.size = usServiceDataLen;
                }
            }
        }
    }

    return xErrCode;
}


BTStatus_t prvBTSetAdvData( uint8_t ucAdapterIf,
                            BTGattAdvertismentParams_t * pxParams,
                            uint16_t usManufacturerLen,
                            char * pcManufacturerData,
                            uint16_t usServiceDataLen,
                            char * pcServiceData,
                            BTUuid_t * pxServiceUuid,
                            size_t xNbServices )
{
    ret_code_t xErrCode = NRF_SUCCESS;
    BTStatus_t xStatus = eBTStatusSuccess;

