aws/amazon-freertos/vendors/nordic/boards/nrf52840-dk/ports/ble/iot_ble_hal_gap.c
    ble_adv_modes_config_t xAdvConfig;

    ble_advdata_t * xSettingData = NULL;
    ble_gap_adv_data_t xNewData;

    memset( &xNewData, 0, sizeof( xNewData ) );
    memset( &xAdvConfig, 0, sizeof( xAdvConfig ) );

    xErrCode = prvBTAdvDataConvert( pxParams->bSetScanRsp ? &prvScanResponseData : &prvAdvData,
                                    pxParams,
                                    usManufacturerLen,
                                    pcManufacturerData,
                                    usServiceDataLen,
                                    pcServiceData,
                                    pxServiceUuid,
                                    xNbServices );
    prvScanResponseData.flags = 0;

    xErrCode = sd_ble_gap_appearance_set( pxParams->ulAppearance );
    BT_NRF_PRINT_ERROR( sd_ble_gap_appearance_set, xErrCode );

    if( xErrCode == NRF_SUCCESS )
    {
        xAdvConfig.ble_adv_fast_enabled = true;
        xAdvConfig.ble_adv_slow_enabled = true;

        if( pxParams->usMinAdvInterval != 0 )
        {
            xAdvConfig.ble_adv_fast_interval = pxParams->usMinAdvInterval;
        }
        else
        {
            xAdvConfig.ble_adv_fast_interval = IOT_BLE_ADVERTISING_INTERVAL;
        }

        if( pxParams->usMaxAdvInterval != 0 )
        {
            xAdvConfig.ble_adv_slow_interval = pxParams->usMaxAdvInterval;
        }
        else
        {
            xAdvConfig.ble_adv_slow_interval = ( IOT_BLE_ADVERTISING_INTERVAL * 2 );
        }

        /* If it is an advertisement data and advertising timeout is provided, set the timeout. Else set the default timeout by vendor. */
        if( pxParams->usTimeout != 0 )
        {
            xAdvConfig.ble_adv_fast_timeout = pxParams->usTimeout;
            xAdvConfig.ble_adv_slow_timeout = pxParams->usTimeout;
        }
        else
        {
            xAdvConfig.ble_adv_fast_timeout = aws_ble_gap_configADV_DURATION;
            xAdvConfig.ble_adv_slow_timeout = aws_ble_gap_configADV_DURATION;
        }

        xAdvConfig.ble_adv_primary_phy = pxParams->ucPrimaryAdvertisingPhy; /* TODO: Check which values can these variable get */
        xAdvConfig.ble_adv_secondary_phy = pxParams->ucSecondaryAdvertisingPhy;
        xAdvConfig.ble_adv_on_disconnect_disabled = true;
    }

    if( !xAdvertisingHandle.initialized )
    {
        ble_advertising_init_t init;
        memset( &init, 0, sizeof( init ) );
        memcpy( &init.advdata, &prvAdvData, sizeof( prvAdvData ) );
        memcpy( &init.srdata, &prvScanResponseData, sizeof( prvScanResponseData ) );
        memcpy( &init.config, &xAdvConfig, sizeof( xAdvConfig ) );
        init.config = xAdvConfig;
        xErrCode = ble_advertising_init( &xAdvertisingHandle, &init );
        BT_NRF_PRINT_ERROR( ble_advertising_init, xErrCode );

        if( xErrCode == NRF_SUCCESS )
        {
            ble_advertising_conn_cfg_tag_set( &xAdvertisingHandle, aws_ble_gap_configAPP_BLE_CONN_CFG_TAG );
        }
    }
    else
    {
        if( xErrCode == NRF_SUCCESS )
        {
            /* It seems we need to provide new buffers for the ble_advertising_advdata_update */
            prvCurrentAdvBuf = 1 - prvCurrentAdvBuf;
            xNewData.adv_data.p_data = prvAdvBinData[ prvCurrentAdvBuf ];
            xNewData.scan_rsp_data.p_data = prvSrBinData[ prvCurrentAdvBuf ];
            xNewData.adv_data.len = iot_ble_hal_gapADVERTISING_BUFFER_SIZE;
            xNewData.scan_rsp_data.len = iot_ble_hal_gapADVERTISING_BUFFER_SIZE;

            if( ( xNewData.adv_data.p_data == NULL ) || ( xNewData.scan_rsp_data.p_data == NULL ) )
            {
                xErrCode = NRF_ERROR_NO_MEM;
            }
        }

        if( xErrCode == NRF_SUCCESS )
        {
            xErrCode = ble_advdata_encode( &prvAdvData, xNewData.adv_data.p_data, &xNewData.adv_data.len );
            BT_NRF_PRINT_ERROR( ble_advdata_encode_ad, xErrCode );
        }

        if( xErrCode == NRF_SUCCESS )
        {
            xErrCode = ble_advdata_encode( &prvScanResponseData, xNewData.scan_rsp_data.p_data, &xNewData.scan_rsp_data.len );
            BT_NRF_PRINT_ERROR( ble_advdata_encode_sr, xErrCode );
        }

        if( xErrCode == NRF_SUCCESS )
        {
            xErrCode = ble_advertising_advdata_update( &xAdvertisingHandle, &xNewData, true );
            BT_NRF_PRINT_ERROR( ble_advertising_advdata_update, xErrCode );
        }

        if( xErrCode == NRF_SUCCESS )
        {
            ble_advertising_modes_config_set( &xAdvertisingHandle, &xAdvConfig );
        }
    }

    xStatus = BTNRFError( xErrCode );

    if( xBTBleAdapterCallbacks.pxSetAdvDataCb != NULL )
    {
        xBTBleAdapterCallbacks.pxSetAdvDataCb( xStatus );
    }

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTSetAdvRawData( uint8_t ucAdapterIf,
                               uint8_t * pucData,
                               uint8_t ucLen )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetScanParameters( uint8_t ucAdapterIf,
                                   uint32_t ulScanInterval,
                                   uint32_t ulScanWindow )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTMultiAdvEnable( uint8_t ucAdapterIf,
                                BTGattAdvertismentParams_t * xAdvParams )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTMultiAdvUpdate( uint8_t ucAdapterIf,
                                BTGattAdvertismentParams_t * advParams )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTMultiAdvSetInstData( uint8_t ucAdapterIf,
                                     bool bSetScanRsp,
                                     bool bIncludeName,
                                     bool bInclTxpower,
                                     uint32_t ulAppearance,
                                     size_t xManufacturerLen,
                                     char * pcManufacturerData,
                                     size_t xServiceDataLen,
                                     char * pcServiceData,
                                     BTUuid_t * pxServiceUuid,
                                     size_t xNbServices )
{
    BTStatus_t xStatus = eBTStatusUnsupported;

    return xStatus;
}


/*-----------------------------------------------------------*/

